# DeleteElement

## Description
Deletes the element at the location specified by the path.

```pascal
FUNCTION DeleteElement(
				XMLHandle   : LONGINT;
				elementPath : STRING):INTEGER;
```

```python
def vs.DeleteElement(XMLHandle, elementPath):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|XMLHandle|LONGINT|   |
|elementPath|STRING|   |

## Version
Availability: from All Versions

This is drop-in function.

## Category
* XML